
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	Поля.Добавить("ДействуетНаОсновании");
	Поля.Добавить("Наименование");
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Данные.ДействуетНаОсновании) Тогда 
		
		Представление = СтрШаблон("%1 (на осн. %2)",Данные.Наименование,Данные.ДействуетНаОсновании);
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
		
	
КонецПроцедуры
